---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor(Autodesk.Revit.DB.Color)
source: html/76d4cbc2-c790-4912-c972-aae686d4d6e8.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor Method

Constructs a color entry with no value assigned.

## Syntax (C#)
```csharp
public AnalysisDisplayColorEntry(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - Color assigned to the entry.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null